# =====================================================================================================================================================================================================================================================================================================================================================================================================================
#  LASTPASS ID  =============  LASTPASS ID  ===============  LASTPASS ID  ================  LASTPASS ID  =================  LASTPASS ID  ==============  LASTPASS ID  ==========================================================================================================================================================================================================================================================================================================================================
# =====================================================================================================================================================================================================================================================================================================================================================================================================================

# 阿里云【中国站】
aliyun_CN_ID =("ven338", "ven360", "ven387", "ven407",)

# 阿里云【国际版】
aliyun_INT_ID = ("ven137", "ven231", "ven244", "ven265", "ven290", "ven293", "ven312", "ven313", "ven323", "ven324", "ven346", "ven356", "ven365", "ven413", "ven416", "ven419", "ven422", "ven423", "ven430", "ven445 ecs", "ven446 ecs", "ven456", "ven457", "ven465", "ven477", "ven486", "ven491", "ven492",)

# watermelon【国际版】
watermelon_aliyun_INT_ID = ("ven318", "ven319", "ven320",)

# 阿里云【国际版】【RAM】
aliyun_INT_RAM_ID = ("ven136", "ven148",)

# watermelon【国际版】【RAM】
watermelon_aliyun_INT_RAM_ID = ("ven221", "ven192", "ven193", "ven194", "ven195", "ven221", "ven240", "ven241", "ven242",)

# 腾讯云【中国站】
tencent_CN_ID = ("ven182",)  

# 腾讯云 子用户登录
tencent_CN_SUB_ID = ("ven322",)

# 腾讯云【国际站】
tencent_INT_ID = ("ven314", "ven315", "ven327", "ven328", "ven367", "ven408", "ven415", "ven418", "ven428", "ven439", "ven441", "ven460", "ven464", "ven473",) 

# 腾讯云 CAM用户登录
tencent_CAM_ID = ("ven366", "ven469",)  

# Tencent (buggy tencent website)
tencent_INT_ven295_ID = ("ven295",)

# 华为云【OPSADMIN】【IAM用户登录】
huawei_OPSADMIN_ID = ("ven236", "ven267", "ven268", "ven273", "ven385", "ven388", "ven399", "ven400", "ven474",) 

# 华为云 【华为帐号登录】
huawei_ID = ("ven303", "ven307", "ven342", "ven345", "ven472", "ven420", "ven425", "ven479",)

# Ucloud
ucloud_ID = ("ven281",)

# Gname
gname_ID = ("ven332", "ven417",)  

# SMS-man
sms_ID = ("ven326",)

# 7211.com
S211_ID = ("ven196",)  

# byteplus
byteplus_ID = ("ven467",)

# Zoho
zoho_ID = ("ven263", "ven264", "ven487")

all_Cloud_ID = (
                    aliyun_CN_ID,
                    aliyun_INT_ID, 
                    aliyun_INT_RAM_ID,
                    tencent_CN_ID,
                    tencent_CN_SUB_ID,
                    tencent_INT_ID,
                    tencent_INT_ven295_ID,
                    tencent_CAM_ID,
                    huawei_OPSADMIN_ID,
                    huawei_ID,
                    ucloud_ID,
                    gname_ID,
                    sms_ID,
                    S211_ID,
                    byteplus_ID,
                    zoho_ID,
)

# =====================================================================================================================================================================================================================================================================================================================================================================================================================
#  MONGO DATABASE ID   ==========  MONGO DATABASE ID  ============  MONGO DATABASE ID  ===============  MONGO DATABASE ID  ============  MONGO DATABASE ID  ===========================================================================================================================================================================================================================================================
# =====================================================================================================================================================================================================================================================================================================================================================================================================================

# 阿里云【中国站】MongoDB_ID
aliyun_CN_MONGODB = (
              "660515a0f932832204669074", # ven338
              "688ad47f1b4e8f3b033fae88", # ven360
              "660515a0f932832204669076", # ven387
              "660515a0f932832204669075", # ven407
            )

# 阿里云【国际版】MongoDB_ID
aliyun_INT_MONGODB = (
              "660515a0f93283220466907d", # ven137
              "660515a0f932832204669081", # ven231
              "660515a0f932832204669082", # ven244
              "660515a0f932832204669083", # ven265
              "660515a0f932832204669084", # ven290
              "660515a0f932832204669085", # ven293
              "6744bd8164cb718827109972", # ven312
              "660515a0f932832204669088", # ven313
              "660515a0f932832204669089", # ven323
              "660515a0f93283220466908a", # ven324
              "660515a0f93283220466908d", # ven346
              "660515a0f93283220466908e", # ven356
              "660515a0f93283220466908f", # ven365
              "660515a0f932832204669092", # ven413
              "660515a0f932832204669093", # ven416
              "660515a0f932832204669094", # ven419
              "6685df2ffcdbbe477f788a29", # ven422
              "6685df2ffcdbbe477f788a2a", # ven423
              "660515a0f932832204669096", # ven430
              "668cb65284e94f7b668336ad", # ven445
              "681cceb513141d46c84297f6", # ven446
              "66f2be0fb7142aba5987da35", # ven456 
              "67cffcb2668e38141a3fd184", # ven457
              "6749fbc984b9b381d74e721b", # ven465
              "67e90299c0cdff4c6fa7a949", # ven477
              "681e0f23ffcf841454e20b23", # ven486
              "688ac83d1b4e8f3b033fae86", # ven491
              "688ac8531b4e8f3b033fae87", # ven492
            )

# 阿里云【国际版】【RAM】
aliyun_INT_RAM_MONGODB = (
              "660515a0f932832204669099", # ven136
              "660515a0f93283220466909f", # ven148
            ) 

# 腾讯云【中国站】
tencent_CN_MONGODB = (
              "660515a0f9328322046690a8", # ven182
              )  

# 腾讯云 子用户登录
tencent_CN_SUB_MONGODB = (
              "67a10f19d5f05d3aa4ccc37d", # ven322
            )

# 腾讯云【国际站】
tencent_INT_MONGODB = (
              "660515a0f9328322046690ab", # ven314
              "660515a0f9328322046690ac", # ven315
              "660515a0f9328322046690b2", # ven327
              "660515a0f9328322046690b3", # ven328
              "660515a0f9328322046690ad", # ven367
              "660515a0f9328322046690ae", # ven408
              "660515a0f9328322046690b0", # ven415
              "660515a0f9328322046690b1", # ven418
              "661f14a2efb5a0356242e2f6", # ven428
              "666045718a68c0fa313f19a4", # ven439
              "668cb3b049631b7fcf82b9c5", # ven441
              "679f81f35e19b801c2ffe112", # ven460
              "673cab005884cd7ec0e214a2", # ven464
              "681cd03e13141d46c84297f7", # ven473
            )

# 腾讯云 CAM用户登录
tencent_INT_CAM_MONGODB = (
              "660515a0f9328322046690b5", # ven366
              "67b333b20b47f8cd0b451627", # ven469
            )

# Tencent (buggy tencent website)
tencent_INT_ven295_MONGODB = (
              "6643a21a3953c8f355c0a007", # ven295 international tencent
            )

# 华为云【OPSADMIN】【IAM用户登录】
huawei_OPSADMIN_MONGODB = (
              "660515a0f9328322046690b6", # ven236
              "660515a0f9328322046690b9", # ven267
              "660515a0f9328322046690ba", # ven268
              "660515a0f9328322046690bb", # ven273
              "660515a0f9328322046690bc", # ven385
              "67216acacd6787b10b4e5576", # ven388
              "660515a0f9328322046690bd", # ven399
              "660515a0f9328322046690be", # ven400
              "67d7ecb700d60d16f4461118", # ven474
            )

# 华为云 【华为帐号登录】
huawei_MONGODB = (
              "660515a0f9328322046690c1", # ven303
              "660515a0f9328322046690c2", # ven307
              "660515a0f9328322046690c3", # ven342
              "660515a0f9328322046690c4", # ven345
              "67b333c50b47f8cd0b451628", # ven472
              "660515a0f9328322046690c5", # ven420
              "660515a0f9328322046690c6", # ven425
              "67d2c019ade6883a28562490", # ven479
            )

# Ucloud
ucloud_MONGODB = (
              "660515a0f9328322046690c8", # ven281
            )

# Gname
gname_MONGODB = (
              "660515a0f9328322046690cb", # ven332
              "660515a0f9328322046690cc", # ven417
            )

# SMS-main
sms_MONGODB = (
              "6639017a8a475f0ccf08ad13", # ven326 sms_man
            )

# 7211.com 
S211_MONGODB = (
              "663901e48a475f0ccf08ad14", # ven196 7211.com
            )

#byteplus
byteplus_MONGODB = (
              "67738a58cbe95821ef0efd24", # ven467 bytePlus
            )

# Zoho
zoho_MONGODB = (
              "68998f88921f052c057737ce", # ven263 Zoho
              "68998f9d921f052c057737cf", # ven264 Zoho
              "68998fc6921f052c057737d0", # ven487 Zoho
            )

# All_Cloud_MongoDB
all_Cloud_MONGODB = (
                    aliyun_CN_MONGODB,
                    aliyun_INT_MONGODB,
                    aliyun_INT_RAM_MONGODB,
                    tencent_CN_MONGODB,
                    tencent_CN_SUB_MONGODB,
                    tencent_INT_MONGODB,
                    tencent_INT_ven295_MONGODB,
                    tencent_INT_CAM_MONGODB,
                    huawei_OPSADMIN_MONGODB,
                    huawei_MONGODB,
                    ucloud_MONGODB,
                    gname_MONGODB,
                    sms_MONGODB,
                    S211_MONGODB,
                    byteplus_MONGODB,
                    zoho_MONGODB,
                    )

# =====================================================================================================================================================================================================================================================================================================================================================================================================================
#  HUAWEI WEBPAGE   ==========  Tencent WEBPAGE  ============  HUAWEI WEBPAGE  ===============  Tencent WEBPAGE  ============  HUAWEI WEBPAGE  ===========================================================================================================================================================================================================================================================
# =====================================================================================================================================================================================================================================================================================================================================================================================================================

# Tencent CAM
Tencent_Webpage = (
                "https://www.tencentcloud.com/zh/account/login/subAccount/200022457909?s_url=https://console.tencentcloud.com/expense",                      # ven366
                "https://www.tencentcloud.com/zh/account/login/subAccount/200039340025?s_url=https://console.tencentcloud.com/expense",                      # ven469
                )

# 华为云【OPSADMIN】【IAM用户登录】
Huawei_Webpage = (
              "https://auth.huaweicloud.com/authui/login.html?id=hwc72804421&locale=zh-cn#/login",            # ven236
              "https://auth.huaweicloud.com/authui/login.html?id=hid_-jcs3_zco-1c9bn#/login",                 # ven267 
              "https://auth.huaweicloud.com/authui/login.html?id=hid_afpdy3ndeg2pt1j#/login",                 # ven268
              "https://auth.huaweicloud.com/authui/login.html?id=hid_v4uabq_f1qhppn1#/login",                 # ven273 
              "https://auth.huaweicloud.com/authui/login.html?id=hid_eev5hgcajnrs-p0#/login",                 # ven385 
              "https://auth.huaweicloud.com/authui/login.html?id=hid_vz7bw73fbmbylhj#/login",                 # ven388
              "https://auth.huaweicloud.com/authui/login.html?id=hid_qsk0u_ee0lfjsc_#/login",                 # ven399
              "https://auth.huaweicloud.com/authui/login.html?id=hid_pb3i1cpxtyp12rg#/login",                 # ven400
              "https://auth.huaweicloud.com/authui/login.html?id=hid_3q913_g1qmt6gmk#/login",                 # ven474
            )

# =====================================================================================================================================================================================================================================================================================================================================================================================================================
#  Total Sum ==========  Total Sum  ============  Total Sum  ===============  Total Sum  ============  Total Sum  =========  Total Sum  =============  Total Sum =========================================================================================================================================================================================================================
# =====================================================================================================================================================================================================================================================================================================================================================================================================================

if __name__ == "__main__":
  for ven_id, mongodb_id in zip(all_Cloud_ID, all_Cloud_MONGODB):
      for item1, item2 in zip(ven_id, mongodb_id):
          print(item1, item2)

  # Sum of Ven_IDs
  total_ids = sum(all_Cloud_ID, ())
  print(len(total_ids)) 

  # Sum of Ven_IDs
  total_mongodb_ids = sum(all_Cloud_MONGODB, ())
  print(len(total_mongodb_ids))

